БИТУправление_медицинским_центром_демо/src/InformationRegisters/МестонахожденияМедкарт/МестонахожденияМедкарт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>МестонахожденияМедкарт</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>ВыданаНаРуки</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Клиника</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </resources>
  <dimensions>
    <name>МедицинскаяКарта</name>
    <type>
      <types>CatalogRef.МедицинскиеКарты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьКлиника</name>
    <comment>(Перенесен в ресурсы регистра в релизе 2.0.21.1)</comment>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БИТУправление_медицинским_центром_демо/src/CommonForms/ФормаМестонахожденияМедкарты/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.Заявка) Тогда
		Если Не Параметры.ВозвратКарты Тогда
			ВрачЗаявки = Параметры.Заявка.Сотрудник;
			Врач = Параметры.Заявка.Сотрудник;
		КонецЕсли;
	КонецЕсли;
	Если ЗначениеЗаполнено(Параметры.Клиника) Тогда
		Клиника = Параметры.Клиника;
	Иначе
		Клиника = УправлениеНастройками.ПолучитьФилиалПоУмолчаниюПользователя();
	КонецЕсли;
	МедицинскаяКарта = Параметры.Медкарта;
	Клиент = МедицинскаяКарта.Клиент;
	
	Если Параметры.ВозвратКарты Тогда
		Элементы.Врач.Доступность = Ложь;
		Элементы.ВыдатьНаРуки.Доступность = Ложь;
		
		Элементы.ФормаОК.Заголовок = "Вернуть карту";
	Иначе
		Элементы.ФормаОК.Заголовок = "Выдать/Переместить карту";
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	СохранитьМестонахождениеМедКарты();
	
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("Медкарта", МедицинскаяКарта);
	ПараметрыОповещения.Вставить("Клиент", Клиент);
	ПараметрыОповещения.Вставить("Выдана", Не Параметры.ВозвратКарты);
	Оповестить("ИзменениеМестонахожденияМедкарты", ПараметрыОповещения);
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СохранитьМестонахождениеМедКарты()
	
	Запись = РегистрыСведений.МестонахожденияМедкарт.СоздатьМенеджерЗаписи();
	Запись.Период = ТекущаяДата();
	Запись.МедицинскаяКарта = МедицинскаяКарта;
	Запись.Клиника = Клиника;
	Запись.Пользователь = ПараметрыСеанса.ТекущийПользователь;
	Если Не Параметры.ВозвратКарты Тогда
		Запись.Сотрудник = ?(ВыдатьНаРуки,Неопределено,Врач);
		Запись.ВыданаНаРуки = ВыдатьНаРуки;
	КонецЕсли;
	Запись.Записать();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ВыдатьНаРукиПриИзменении(Элемент)
	
	Если ВыдатьНаРуки Тогда
		Врач = Неопределено;
	Иначе
		Врач = ВрачЗаявки;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВрачПриИзменении(Элемент)
	
	ВыдатьНаРуки = Не ЗначениеЗаполнено(Врач);
	
КонецПроцедуры

#КонецОбласти
